reports/mysql-coupon-loadtest/runs/rate-1000stock-500rps-pool20-001/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 200-2000, gracefulStop: 30s)


running (01.0s), 0311/0311 VUs, 44 complete and 0 interrupted iterations
unique_member_first_request   [  10% ] 0311/0311 VUs  01.0s/10s  500.00 iters/s

running (02.0s), 0490/0490 VUs, 181 complete and 0 interrupted iterations
unique_member_first_request   [  20% ] 0490/0490 VUs  02.0s/10s  500.00 iters/s

running (03.0s), 0619/0620 VUs, 415 complete and 0 interrupted iterations
unique_member_first_request   [  30% ] 0619/0620 VUs  03.0s/10s  500.00 iters/s

running (04.0s), 0749/0749 VUs, 636 complete and 0 interrupted iterations
unique_member_first_request   [  40% ] 0749/0749 VUs  04.0s/10s  500.00 iters/s

running (05.0s), 0889/0890 VUs, 853 complete and 0 interrupted iterations
unique_member_first_request   [  50% ] 0889/0890 VUs  05.0s/10s  500.00 iters/s

running (06.0s), 0862/0899 VUs, 1371 complete and 0 interrupted iterations
unique_member_first_request   [  60% ] 0862/0899 VUs  06.0s/10s  500.00 iters/s

running (07.0s), 0853/0899 VUs, 1880 complete and 0 interrupted iterations
unique_member_first_request   [  70% ] 0853/0899 VUs  07.0s/10s  500.00 iters/s

running (08.0s), 0708/0899 VUs, 2525 complete and 0 interrupted iterations
unique_member_first_request   [  80% ] 0708/0899 VUs  08.0s/10s  500.00 iters/s

running (09.0s), 0530/0899 VUs, 3203 complete and 0 interrupted iterations
unique_member_first_request   [  90% ] 0530/0899 VUs  09.0s/10s  500.00 iters/s

running (10.0s), 0358/0899 VUs, 3875 complete and 0 interrupted iterations
unique_member_first_request   [ 100% ] 0358/0899 VUs  10.0s/10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 4253    411.781646/s
    checks_succeeded...: 100.00% 4253 out of 4253
    checks_failed......: 0.00%   0 out of 4253

    ✓ business response or no server error

    CUSTOM
    coupon_issue_business_response_under_2s...: 77.52% 3297 out of 4253
    coupon_issue_issued.......................: 1000   96.821454/s
    coupon_issue_rejected.....................: 3253   314.960191/s

    HTTP
    http_req_duration.........................: avg=1.49s min=118.35ms med=1.45s max=4.4s  p(90)=2.39s p(95)=2.71s
      { expected_response:true }..............: avg=1.91s min=288.56ms med=1.9s  max=4.32s p(90)=2.72s p(95)=2.83s
    http_req_failed...........................: 76.48% 3253 out of 4253
    http_reqs.................................: 4253   411.781646/s

    EXECUTION
    dropped_iterations........................: 747    72.325626/s
    iteration_duration........................: avg=1.49s min=118.56ms med=1.45s max=4.4s  p(90)=2.39s p(95)=2.71s
    iterations................................: 4253   411.781646/s
    vus.......................................: 359    min=311          max=889
    vus_max...................................: 899    min=311          max=899

    NETWORK
    data_received.............................: 855 kB 83 kB/s
    data_sent.................................: 1.3 MB 131 kB/s



running (10.3s), 0000/0899 VUs, 4253 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/0899 VUs  10s  500.00 iters/s